In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('movies.csv')

In [3]:
df.shape

(10, 5)

In [4]:
df.head()

   user_id movieName  rating category       type
0        1      hulk     5.0   action  hollywood
1        2      thor     5.0   action  hollywood
2        3   ironman     5.0   action  hollywood
3        4      zero     3.0   comedy  bollywood
4        5       kgf     5.0   action  tollywood

In [5]:
df.tail()

   user_id movieName  rating category       type
5        6    batman     5.0   action  hollywood
6        7     sanju     NaN   comedy  bollywood
7        8   aquaman     NaN   action  hollywood
8        9     x-men     4.5   action  hollywood
9       10   x-men 2     3.5   action  hollywood

In [6]:
# show me best hollywood
hollywoodMovies = df[df['type'] == 'hollywood']

In [7]:
hollywoodMovies

   user_id movieName  rating category       type
0        1      hulk     5.0   action  hollywood
1        2      thor     5.0   action  hollywood
2        3   ironman     5.0   action  hollywood
5        6    batman     5.0   action  hollywood
7        8   aquaman     NaN   action  hollywood
8        9     x-men     4.5   action  hollywood
9       10   x-men 2     3.5   action  hollywood

In [9]:
hollywoodMovies.sort_values('rating', ascending=False).head()

   user_id movieName  rating category       type
0        1      hulk     5.0   action  hollywood
1        2      thor     5.0   action  hollywood
2        3   ironman     5.0   action  hollywood
5        6    batman     5.0   action  hollywood
8        9     x-men     4.5   action  hollywood